{"pageProps":{"page":{"title":"Work Experience","slug":"founder","date":"2020-02-25T10:03:11.000Z","tags":null,"category":null,"link":null,"description":null,"type":"text","content":"<p>I believe in a world where data-driven decisions form the basis of business strategies.\nIn my career so far,\nI've solved business problems with advanced technological approaches,\nin particular with the help of data aggregation and machine learning.\nBesides that, my passion is continuous progress and self-improvement.</p>\n<p>Below is an overview of my work experience so far.\nIf you'd like to see a traditional overview of my work experience,\nfeel free to also take a look at <a href=\"https://github.com/lorey/resume\">my resumé</a> or <a href=\"https://www.linkedin.com/in/karllorey\">my Linkedin profile</a>.\nIf you're more interested in the technological aspects of my work, check out <a href=\"/techie\">Techie for a description of my stack and academic background</a> and <a href=\"/portfolio\">Maker containing my portfolio</a></p>\n<h2>Managing Partner, First Momentum</h2>\n<p>With <a href=\"http://firstmomentum.vc\">First Momentum Ventures</a>, we're the first venture capital fund in Germany founded while still being students and probably the youngest fund all over Europe.\nAs a co-founder of First Momentum, I'm one of two chief executives and responsible for our strategy, our products and the technology.\nMy technical and academic background allows me to build automated and scalable approaches to investing and Venture Capital in general.</p>\n<ul>\n<li>setting up an executing a Venture Capital fund, raising 5 million Euros from investors in the process</li>\n<li>designing and implementing a crawler network spotting every early-stage startup in the DACH region resulting in a competitive advantage of our fund</li>\n<li>designing, building, and launching a platform that enables investors to access our dealflow resulting in significant revenues</li>\n<li>building a machine learning solution to predict relevant dealflow enabling our investing team to save more than 50% time in the screening process</li>\n<li>selecting and screening promising, tech-driven, early-stage startups as well as leading the investments of and advising <a href=\"https://www.peers-solutions.com/\">Peers</a> (<a href=\"https://medium.com/first-momentum-ventures/first-momentum-ventures-is-backing-peers-492a11ce4314\">1</a>) and <a href=\"https://www.verlingo.de/\">Verlingo</a> (<a href=\"https://gruender.wiwo.de/verlingo-auftakt-fuer-die-arbeitszeugnis-analysten/\">1</a>, <a href=\"https://medium.com/first-momentum-ventures/transforming-digital-recruiting-why-we-are-backing-the-startup-verlingo-386dfb9fa664\">2</a>).</li>\n</ul>\n<p>Press:\n<a href=\"https://www.gruenderszene.de/business/kit-first-momentum-ventures-studi-vc\">First Closing on Gründerszene</a>,\n<a href=\"https://www.gruenderszene.de/business/frank-thelen-first-momentum\">Frank Thelen's investment on Gründerszene</a>,\n<a href=\"https://t3n.de/news/studenten-startups-fonds-1088286/\">First Closing on T3N</a>,\n<a href=\"https://t3n.de/news/gruenderunis-deutsches-stanford-1246203/\">Florian Nöll mentioning First Momentum on T3N</a></p>\n<h2>CTO, German IT Jobs</h2>\n<p>Before First Momentum and during my master studies, I co-founded an HR startup called <a href=\"http://germanitjobs.com\">German IT Jobs</a>.\nWe built a platform that helped foreign developers to find a job in Germany while focusing on an automated sourcing and screening process.\nAs a co-founder, I was responsible for developing the business together with my co-founder and leading the technological development as the CTO.</p>\n<ul>\n<li>developed an algorithm to find developers globally matching a specific job ad</li>\n<li>designed and implemented a platform that allowed foreign developers to apply for jobs resulting in conversion rates significantly higher than the industry average</li>\n<li>automated the active sourcing process of recruiters resulting in a 90% reduction of time required to find applicants</li>\n<li>leveraged Facebook's ad engine to target IT professionals woldwide resulting in a cost per application far below industry average</li>\n</ul>\n<h2>Co-Founder, Road Genius</h2>\n<p>Together with a team of three I built an app for children to play when traveling and won EUs largest automotive hackathon.\nWith our idea, <a href=\"http://roadgenius.de\">Road Genius</a>, we pitched in front of Volkswagen's C-level executives and were in talks to sell our app to Volkswagen.\nPress coverage:\n<a href=\"https://www.cebit.de/en/news-trends/news/vw-hackathon-the-winner-is--1592\">1</a>,\n<a href=\"http://www.automotiveit.eu/vw-hackathon-road-genius-triumphieren/news/id-0049270\">2</a>,\n<a href=\"https://www.computerwoche.de/a/die-gewinner-des-vw-programmierwettbewerbs,3096127\">3</a>,\n<a href=\"https://www.youtube.com/watch?v=1YpsJsB6Hwg\">4</a>.</p>\n<h2>Research Assistant, IPD, KIT</h2>\n<p>During my master's studies, I worked as a research assistant at IPD resulting in a publication I presented at the renown <a href=\"https://www.resurchify.com/conference_ranking_details.php?id=117\">CAiSE conference</a> in 2017.</p>\n<ul>\n<li>developed a novel approach to enable encrypted database storage while retaining most of the query optimization abilities</li>\n<li>integrated a so-called Secure Storage algorithm into the Object Relational Mapping component to allow for a transparent encryption</li>\n<li>co-authored a paper that I presented at CAiSE, Ljubljana, Slovenia</li>\n</ul>\n<h2>Research Assistant, IMK-ASF, KIT</h2>\n<ul>\n<li>conducting research on flight data to find influencing factors on airplane vibrations</li>\n<li>finding reasons for these vibrations which led to their elimination</li>\n</ul>\n<h2>Owner, SaaS for online course enrollment</h2>\n<p>This was my very first project I started during school.\nI built a (German) SaaS solution for schools to enroll students into courses called <a href=\"http://kursverwaltungonline.de\">Kursverwaltung Online</a>.\nThe software is still in use to date.</p>\n<h2>Working Student and Intern, Palmer AG</h2>\n<p>Before and during my Bachelor's studies, I was an intern and then working student for a SAP consulting company.\nDuring my time there, I worked with the head of the IT department to develop web applications for the company's intranet.</p>\n"}},"__N_SSG":true}