{"pageProps":{"post":{"title":"Why every founder should use a notebook","slug":"reasons-to-use-a-notebook-as-a-founder","date":"2018-12-28T09:30:13.000Z","tags":"Notebook, Organization, Entrepreneurship","category":"Entrepreneurship","link":null,"description":null,"type":"text","content":"<p>For some time I have been using a notebook now.\nIt's simple, analogue, and convenient nonetheless.\nI first noticed people using one in university, when we heard talks from founders at our university club.\nAt that time, I bought one myself to try it out and have never looked back.\nAnd I think every founder should use one.</p>\n<p>In this article I would like to articulate my love for notebooks.\nAnd I would like to help you get started using one.\nFirst, by talking about my usage.\nSecondly, by summarizing the benefits.\nAnd lastly, by giving some recommendations on which notebook to choose and how to structure it.</p>\n<h2>How I use my notebook</h2>\n<p>I basically carry my notebook with me all the time.\nAnywhere.\nAs soon as something comes to my mind: I write it down.\nFor every meeting: I create a meeting note.\nFor every call: I write a note.\nFor every task that comes to my mind: I add a task to my ToDo note.\nFor every thought or self-reflection: I make a note.\nAs a result, if I need to recall something, I can just look it up.\nNo more searching across different places.\nAnd since everything is chronological, you find things quickly.</p>\n<h2>My top 5 reasons to use a notebook</h2>\n<p>So here are my top reasons to use a notebook in order of importance,\nprobably biased by my viewpoint from founder/investor perspective.</p>\n<h3>1. Compendium Character</h3>\n<p>The most important reasons for me is that all of my notes are in one place.\nThis has two significant advantages.\nOne being that you do not have to switch between tools and write everything down in one notebook.\nThe other being that you also don't have to search in different places.\nWhile digital solutions offer this too, nothing keeps your notes together like one notebook.</p>\n<h3>2. Portable anywhere</h3>\n<p>Another important reason for an analogue solution and thus a notebook is that you can carry a notebook anywhere.\nSure, you can take your phone anywhere, too.\nBut what about meetings, dinners, long travels, vacations, or nature?\nA notebook needs no power, no internet connection and is always available.\nI think the major advantage over a phone or tablet is that nothing will distract you when using it.\nAnd if everything else has an empty battery, your notebook is still there.</p>\n<h3>3. Unobtrusive usage</h3>\n<p>Building upon the last point, I would like to emphasize that analogue solutions still are more broadly accepted by society.\nI found this to be especially useful for business meetings or lunches where the usage of a smartphone or tablet would be frowned upon.\nOn the contrary, writing in your notebook shows that you take the other person seriously and consider their advice.</p>\n<h3>4. One-handed sketching and note-taking</h3>\n<p>Another big advantage for me is that handwriting is the fastest way (known to me) to take one-haded notes or make sketches.\nBut why is this important?\nWhile people might be able to type faster with a keyboard or even with a phone,\nwhen I take notes I often include sketches, layouts, or even drawings.\nThe benefit of handwritten notes and a notebook is that you can do it one-handed,\nfor example while being on the phone.</p>\n<h3>5. Digitizable later</h3>\n<p>While many digital solutions to take notes exist,\nto me, none have all of the aforementioned benefits.\nSo if you still want to use notes in a digital format later-on,\nyou can always digitize specific pages or the whole book if you like.</p>\n<h2>My Recommendations</h2>\n<p>Finally, some recommandations on structuring and choosing your notebook.</p>\n<h3>Structuring your notebook</h3>\n<p>To dive deeper into the topic, I can highly recommend the <a href=\"https://bulletjournal.com/pages/learn\">bullet journal method</a>\nas a starting point to structure your thoughts.\nFirst and foremost, simply make it a habit to take your notebook with you all the time.\nThe rest will follow automatically by using it.</p>\n<h3>Choosing a notebook</h3>\n<p>If you're thinking about buying a notebook, I would recommend the following:\nMy go-to format would be something close to DinA5 as is very portable and not too bulky.\nKeep in mind that you need to choose a smaller format if you want to carry it around in your pocket.\nFor the layout, I prefer a dotted layout over a squared one,\nas it gives you equally good orientation but more freedom.\nThus, I think the most popular choice would be a <a href=\"http://a.co/d/6W1PsBp\">Moleskine</a>.\nPersonally, I prefer the <a href=\"http://a.co/d/cTNSIV5\">Lechtturm1917</a> version though.\nThe design is solid and very similar to a Moleskine, but it offers two significant benefits:\nFirstly, the pages are numbered, which is essential for me for later reference.\nSecondly, it comes with two bookmarks instead of one.\nAlso make sure to use the same pen everytime, it makes writing so much simpler.</p>\n<p>If you have any questions, additions, comments, thoughts, let me know!\nHave fun with your notebook.</p>\n<p>Further reading:</p>\n<ul>\n<li><a href=\"https://news.ycombinator.com/item?id=18837345\">HN: How do you keep track of your creative thoughts?</a></li>\n<li>If you are into digital solutions, I can highly recommend <a href=\"https://notion.so\">notion.so</a> and some <a href=\"https://www.youtube.com/watch?v=w_mh91IRLL8\">advanced Notion.so setups</a></li>\n</ul>\n"}},"__N_SSG":true}