{"pageProps":{"post":{"title":"How to recover an AWS EC2 instance without the private key","slug":"recover-aws-ec2-instance-without-private-key","date":"2019-09-03T09:30:13.000Z","tags":"AWS, Tech","category":"Tech","link":null,"description":null,"type":"text","content":"<p>Lost the private key for your EC2 instance and can't login via ssh anymore?\nThis tutorial will show you how to recover your EC2 instance by setting a new key pair to login.</p>\n<p>What we'll do:</p>\n<ul>\n<li>mount the original instance's volume (a.k.a. it's filesystem) inside another temporary EC2 instance</li>\n<li>modify the keys allowed to login</li>\n<li>unmount the volume from the temporary instance and re-mount it in the original instance</li>\n<li>login with a new key to your original instance</li>\n</ul>\n<p>In short, this replaces the key needed for ssh to connect with a new one of your choice.</p>\n<h2>AWS Recovery Automation</h2>\n<p>There's an <a href=\"https://aws.amazon.com/premiumsupport/knowledge-center/recover-access-lost-key-pair/\">Amazon recovery automation thing</a> available that aims to recover your instance automatically,\nit sadly did not work for me.\nSo here we go.</p>\n<h2>Step 1: Find the instance</h2>\n<p>Go to the AWS EC2 console and find your (lost) instance.\nMake sure you're in the right availability zone.\nNote down the instance ID as well as the subnet.\nAlso note the instance's volume</p>\n<h2>Step 2: Create a temporary instance</h2>\n<p>Launch an instance in the same availability zone.\nMake sure to use the same subnet.\nCreate a new key pair with that instance\nor use the key pair you'd like to use for your original instance from now on.</p>\n<h2>Step 3: Attach the original volume to a temporary instance</h2>\n<p>Stop the original instance to be able to unmount the storage.\nNote the volume ID under <code>Attachment information</code>.\nGo to volumes and detach the volume with <code>Actions - Detach Volume</code>.\nAttach the volume to the temporary instance with <code>Actions - Attach Volume</code>.\nChoose one of the given options and note it down, e.g. <code>/dev/sdf</code>.\nConnect to the temporary instance via SSH and mount the volume, e.g. to <code>/data</code> via the following command:</p>\n<pre><code>mount /dev/sdf /data\n</code></pre>\n<p>The volume of the original instance is now mounted to <code>/data</code>.\nThis allows us to now modify the allowed keys.</p>\n<h2>Step 4: Modify the allowed keys</h2>\n<p>We can now set the key of the current, temporary instance as an allowed key of the original instance.\nThe keys allowed to log in are stored in a file called <code>~/.ssh/authorized_keys</code> (background on <a href=\"https://www.ssh.com/ssh/authorized_keys/\">authorized_keys</a>).\nInside this file is just a line-by-line list of authorized keys.\nBecause of this, we can just append the file of our temporary instance (and thus our key from the temporary instance)\nto the file of our original instance.</p>\n<pre><code>cat ~/.ssh/authorized_keys >> /data/home/admin/.ssh/authorized_keys\n</code></pre>\n<p>Make sure to swap admin with the actual user you want to sign in as (check your ssh connection command if you're unsure).</p>\n<h3>Check if everything went right</h3>\n<pre><code>cat /data/home/admin/.ssh/authorized_keys\n</code></pre>\n<p>should now contain the contents of:</p>\n<pre><code>cat ~/.ssh/authorized_keys\n</code></pre>\n<h2>Step 4: Bring everything back in order</h2>\n<p>We now have set up another key for login.\nAll that's left is to unmount the volume from the temporary instance and mount it to the original instance.</p>\n<p>First, we have to unmout the storage of the original instance inside the temporary instance by\n<code>umount /dev/sdf</code> (make sure to use the right path here).\nAfterwards, you stop the temporary instance via the AWS console under <code>Instances</code>.\nYou then attach the volume to the original instance inside the AWS console under <code>Volumes</code> via <code>Actions - Attach volume</code>.\nType in the original instance ID as well as <code>xvda</code> as the mount point.\nOtherwise, you might get an error pointing out that there's no root volume when starting the instance.\nYou can now re-start the original instance and should be able to login with the new key.</p>\n<p>Make sure to delete the temporary instance in case everything went well.</p>\n<h2>Conclusion</h2>\n<p>So this guide showed you how to recover an AWS EC2 instance if you lose you private key.\nWe did this by using a temporary instance to swap or actually extend the authorized_keys file.\nYou should now be able to login to the original instance with your new key.</p>\n<p>There's also a slightly different <a href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ec2-key-pairs.html#replacing-lost-key-pair\">guide by AWS</a>.</p>\n"}},"__N_SSG":true}