{"pageProps":{"post":{"title":"How to set up Black with Debian, PyCharm, and IdeaVim","slug":"set-up-black-pycharm-ideavim","date":"2019-07-28T09:30:13.000Z","tags":"Python, Black, Docker, Pycharm, IdeaVim, Tech","category":"Tech","link":null,"description":null,"type":"text","content":"<p>I've come to like the code formatter <a href=\"https://black.readthedocs.io/en/stable/index.html\">Black</a> for Python.\nIt's opinionated, deterministic and thus very minimalistic.\nAnd since I'm using it on more and more projects, I wanted to integrate it into my workflow.</p>\n<p>So usually, you just install Black globally via <code>pip3 install black</code>.\nBut since I use Debian which still ships with Python 3.5\nthis yielded some smaller challenges as Black only runs under Python 3.6+.\nThis post is a small tutorial on how you can use Black on Debian and integrate it into the command line, PyCharm, and IdeaVim.</p>\n<h2>Challenge 1: Python 3.6+ on Debian</h2>\n<p>Since Debian currently ships with Python 3.5, I needed to get Python 3.6 running somehow.\nWhile installing <a href=\"https://www.anaconda.com/distribution/\">Anaconda</a> or <a href=\"https://www.python.org/downloads/\">Python 3.6+ manually</a>\nare other solutions <a href=\"https://community.hortonworks.com/idea/212478/independent-python-vs-anaconda-python.html\">might</a> <a href=\"https://unix.stackexchange.com/q/332641\">work</a>,\nI decided to simply use Docker, as this is what I use for my regular development anyhow.\nSimplest solution was to use an existing docker image,\nnamely <a href=\"https://github.com/jbbarth/docker-black\">jbbarth's docker-black</a>,\nwhich allows you to mount the current working directory into a (newly created) container, format the desired file, and throw the container away afterwards.\nSounds more complicated than it is, you just run one single command et voila.\nThis method has the additional benefit that it adheres to any <a href=\"https://github.com/psf/black#pyprojecttoml\">pyproject.toml</a> which can store configuration like line length.\nThere's also a more sleek image at <a href=\"https://github.com/cytopia/docker-black\">cytopia/docker-black</a> which might take less space.</p>\n<p>So to run black irrespective of your local Python installation via <code>black main.py</code>,\nyou run</p>\n<pre><code>docker run --rm -v $(pwd):/code jbbarth/black main.py\n</code></pre>\n<p>This creates a new container, mounts the current working directory into <code>/code</code> and formats <code>main.py</code>.\nAfterwards, the <code>--rm</code> flag will delete the container as well as the created volume.\nSo far, so good, but as this command is quote long, I had to build an alias to invoke it quickly as a next step.</p>\n<h2>Challenge 2: Black from command line</h2>\n<p>So to avoid the cumbersome docker syntax each time, you now want an alias to just run <code>black main.py</code> everywhere.\nTo do this, you have to map the black command to your black running inside docker.\nYou can do this by adding</p>\n<pre><code>black() { docker run --rm -v $(pwd):/code jbbarth/black $*; }\n</code></pre>\n<p>to your bashrc or zshrc.\nAfter opening a new terminal, you should now be able to invoke the black formatter inside docker by running <code>black ...</code>.</p>\n<h2>Challenge 3: Black in PyCharm</h2>\n<p>To now integrate this setup into PyCharm,\nyou have to slightly adapt the <a href=\"https://black.readthedocs.io/en/stable/editor_integration.html#pycharm-intellij-idea\">offical installation instructions</a>.\nGo to <code>File -> Settings -> Tools -> External Tools</code>.\nClick the + icon to add a new external tool with the following values:</p>\n<ul>\n<li>Name: <code>Black</code></li>\n<li>Description: <code>Black code formatter</code></li>\n<li>Program: <code>/usr/bin/docker</code></li>\n<li>Arguments: <code>run --rm -v $FilePath$:/$FilePath$ jbbarth/black \"$FilePath$\"</code></li>\n<li>Working directory: <code>$ProjectFileDir$</code></li>\n</ul>\n<p>Test it by running it with an opened python file via <code>Tools -> External Tools -> Black</code>.\nAfter you made sure it works, re-open it again and untick <code>open console</code> to avoid a new console at every run.\nYou can basically mirror this guide to install a file watcher\nthat formats on every save (see <a href=\"https://black.readthedocs.io/en/stable/editor_integration.html#pycharm-intellij-idea\">the docs</a>).</p>\n<p>Note: As you can see, this only mounts the current file and thus does not adhere to any config files.\nThe same applies for the next step as it builds upon this one.</p>\n<h2>Challenge 4: Black in IdeaVim</h2>\n<p>Now for the bonus part: to trigger this setup quickly from within IdeaVim and format the current file with a single command,\nequivalent to the <a href=\"https://black.readthedocs.io/en/stable/editor_integration.html#vim\">regular vim plugin</a>,\nwe have to map the <code>:Black</code> command to our external command in PyCharm.\nTo do this, we edit our <code>.ideavimrc</code> file where all IdeaVim configuration is stored,\nand add the following line:</p>\n<pre><code>command Black action Tool_External Tools_Black\n</code></pre>\n<p>Now typing <code>:Black</code> will re-format the current file.</p>\n<h2>Summary</h2>\n<p>This tutorial showed you one way to include Black into you daily development (esp. on Debian).\nIf you have any questions or feedback, hit me up on Twitter <a href=\"https://twitter.com/karllorey\">@karllorey</a>\nor any of the other platforms listed below.</p>\n<h2>Notes</h2>\n<h3>Deleting all docker containers of a specific image</h3>\n<p>If you want to remove all containers derived from a specific image, e.g. if you forgot to add the --rm flag:</p>\n<pre><code>docker rm $(docker ps -a --filter ancestor=jbbarth/black -q)\n</code></pre>\n"}},"__N_SSG":true}