{"pageProps":{"post":{"title":"Automate call and meeting scheduling: a tool comparison (Meetingbird, Calendly, G Calendar)","slug":"meeting-scheduling-tool-comparison","date":"2020-02-25T09:30:13.000Z","tags":"Automation, Entrepreneurship","category":"Entrepreneurship","link":null,"description":null,"type":"text","status":"draft","content":"<p>Want to save time when scheduling meetings and calls?\nThis article explains how to schedule meetings automatically,\ncompares several tools and gives a few tips as well as best practices,\nespecially for startups, founders, and entrepreneurs.</p>\n<p>As a co-founder of <a href=\"http://firstmomentum.vc\">First Momentum Ventures</a>, I have a lot of meetings and calls.\nMeeting a founder for dinner, hearing a startup pitch, coordinating a team or board meeting.\nSince my calendar is rather full, scheduling a call or meeting is rather cumbersome.\nTypically, you have to suggest one to three slots, sometimes for several iterations.\nWriting emails back and forth takes time and delays the actual communication.\nSo we set out to find tools that automate this task.</p>\n<h3>How automated scheduling works</h3>\n<p>There are several services in the market which automate scheduling.\nUsually, they work as follows:</p>\n<ol>\n<li>You send a link to the person you'd like to meet/call.</li>\n<li>The person goes to a website that shows your availability or predefined slots.</li>\n<li>The person picks a convenient time slot.</li>\n<li>Both of you receive an invitation by email.</li>\n</ol>\n<p>Think of it like using doodle, but with predefined options that match you calendar and with instant booking.</p>\n<h3>Three tools that automate scheduling</h3>\n<p>While there are many solution to automate scheduling, I have picked three options that have a free tier and thus a startup-friendly pricing.</p>\n<h4>calendly - simple and easy but limited</h4>\n<p>A simple solution to schedule meetings is calendly.\ncalendly allows you to define recurring time slots where you're willing to make meetings.\nIt then uses your calendar to check whether you're available at a specific time slot.\nIf you're available, people can book a meeting and both of you will get an invite via email.</p>\n<ul>\n<li>Pro: Clean and simple interface</li>\n<li>Pro: Possibility to edit the invitation format and use variables, e.g. <code>Call: {caller name} &#x3C;> Karl</code> for all of your calls.</li>\n<li>Con: Only one event type in the free tier.</li>\n<li>Con: No team scheduling in the free tier.</li>\n<li>Con: No reminders in the free tier.</li>\n</ul>\n<p>calendly's premium and pro plans cost $8 to $12 USD per user per month (billed anually) and provide customization, team scheduling, notifications, and integrations.</p>\n<h4>meetingbird - feature-rich, team-focused but generic</h4>\n<p>There's also <a href=\"https://www.meetingbird.com/\">meetingbird</a>, recommended to me by Philip, co-founder of <a href=\"https://understand.ai\">understand.ai</a>.\nIt has a lot more features in the free tier than calendly and feels more feature-rich, although I miss some of the calendly simplicity.\nAs with calendly, you can define time slots for specific event types, e.g. calls and meetings.\nAdditionally, meetingbird provides the possibility to add one-time links (non-repeating slots) and polls (think doodle).\nThe user interface feels a litte bit more bloated and buggy.\nI had to switch browsers to select time slots, for example.</p>\n<ul>\n<li>Pro: More free tier features.</li>\n<li>Pro: Team scheduling within the free tier.</li>\n<li>Con: Calendar events not customizable with variables.</li>\n<li>Con: No generic link that lists all your available event types (calls, meetings, ...)</li>\n</ul>\n<p>meetingbird's pro plan is $9 USD per user per month (billed anually) and provides mostly customization.</p>\n<h4>Google Calendar - minimalistic</h4>\n<p>Google Calendar also provides the possibility to schedule meetings via a specific link.\nTo try it out, go to your calendar, create a time slot by dragging an event and then choose <code>time blocks</code> instead of <code>event</code>.\nWhile I have not used this feature extensively, it seems to be very limited and not suitable for most of scheduling tasks.</p>\n<ul>\n<li>Pro: Integrated into Google Calendar.</li>\n<li>Pro: Free.</li>\n<li>Con: No team scheduling.</li>\n<li>Con: Ugly web interface.</li>\n</ul>\n<h3>Best practices, tips and tricks</h3>\n"}},"__N_SSG":true}