{"pageProps":{"post":{"title":"Switching from Lektor to Nikola (static site generators)","slug":"switch-from-lektor-to-nikola","date":"2020-03-10T16:03:35.000Z","tags":"Python, Lektor, Nikola, Tech","category":"Tech","link":null,"description":null,"type":"text","status":null,"content":"<p>I decided to migrate this website/blog from Lektor to Nikola.\nBoth are static site generators\nimplemented in Python\nthat allow you to generate a static, secure, and maintenance-free website/blog.\nHere is my experience, why I did it, how to do it, and what to expect.\nIn short: While I liked Lektor for its simplicity,\nit lacked several features I needed.\nSo far, Nikola has these features and many more\nwhich is why I'm very happy to have switched.\nRead the rest of the pros and cons here.</p>\n<h1>Background: Static Site Generators</h1>\n<p>Both Lektor and Nikola are Static Site Generators (SSG) implemented in Python.\nYou basically create everything on your computer and the the generator generates HTML\nwhich can be hosted on GitHub or almost everywhere without any hassle.\nBesides, it's blazing fast, secure, and needs no server configuration/maintenance.\nFind an overview at <a href=\"https://www.fullstackpython.com/static-site-generator.html\">Full Stack Python</a>.</p>\n<h1>Lektor vs. Nikola</h1>\n<p>When I created this website, I chose Lektor for it's simplicity.\nCompared to Wordpress, which I had used before, it was easy to set up and maintain.</p>\n<h2>Why not Lektor?</h2>\n<ul>\n<li>to little default markup: the site did not rank for quite some time which might be due to litte semantic markup</li>\n<li>it especially misses several essential features to rank and make the site visible\n<ul>\n<li>no RSS feed by default which allows search engines to discover new posts quickly</li>\n<li>no meta tags which would enable nice previews on social media (OpenGraph for Facebook, etc.)</li>\n</ul>\n</li>\n<li>default directory structure: blog posts in Lektor all have an own folder containing a file named contents.lr.\nWhile this looks trivial and helps with structuring files belonging to a post, I simply did not like it too much.</li>\n<li>Lektor does not use regular virtualenv environments which just makes stuff a little trickier to understand</li>\n<li>the ecosystem is small, there are not many plugins, and development seems to have halted</li>\n</ul>\n<h2>Why Nikola?</h2>\n<p>Again, this is highly opinionated.</p>\n<ul>\n<li>most-active repository compared to <a href=\"https://github.com/lektor/lektor\">Lektor</a>, <a href=\"https://github.com/getpelican/pelican\">Pelican</a>, <a href=\"https://github.com/mkdocs/mkdocs/\">MkDocs</a>, <a href=\"https://github.com/Anomareh/mynt\">mynt</a>, and other static site generators in Python</li>\n<li>seamless integration of blog posts and regular pages</li>\n<li>clear documentation</li>\n<li>lots(!) of features and configuration options</li>\n<li>RSS feeds, tags, categories, blog archives, etc.</li>\n<li>themes with semantic HTML</li>\n</ul>\n<h1>Switching from Lektor to Nikola</h1>\n<p>I basically set up a clean Nikola project and then adapted my old content.\nHere's what I did with a rough time estimation:</p>\n<ul>\n<li>Reading the docs and getting started (30m)</li>\n<li>Setting up a clean project within my existing repo (30m)</li>\n<li>Renaming articles and sites (15m)</li>\n<li>adding Nikola-specific markdown headers (5m per site/article)</li>\n<li>formatting code blocks to leverage syntax highlighting and fixing markdown errors (30m)</li>\n<li>integrating my existing theme into Nikola (2h)</li>\n<li>setting up deployment on Travis CI (30m)</li>\n</ul>\n<h1>What I like so far</h1>\n<ul>\n<li>a lot of functionality with sane defaults</li>\n<li>whole transition took me less than one day, no weird errors, no frustration</li>\n<li>clean structure that enables (even hierarchical) posts and pages without any issues</li>\n<li>super fast deployment setup with github (took me one minute)</li>\n<li>great default/base templates with mako or jinja as a templating engine that can be adapted really easily</li>\n</ul>\n<h1>What I don't like so far</h1>\n<ul>\n<li>The config file is huge and includes a lot of documentation, basically very similar to Django.\nWhile I like to configure stuff, it's hard to find settings and understand all implications.</li>\n<li>Lektor has an amazing concept to define own models, I haven't figured out how to do something similar in Nikola, e.g. for my <a href=\"/founder\">CV</a>.</li>\n<li>There are not many templates available. I've also found my template to be quite messy and without clean syntax.</li>\n<li>There's a plugin system heavily relying on <a href=\"https://pydoit.org/\">doit</a> which makes site-creation very efficient but extending as a result rather difficult to understand. For example, I don't know how to insert a list of all subpages into the the current page which should be quite easy.</li>\n</ul>\n<h1>Issues</h1>\n<p>If you're also getting started, here are the issues I ran into.\nAs I said, not many and not frustrating :)</p>\n<h2>Overwriting themes</h2>\n<p>While there are a few basic and advanced themes you can build upon,\nit took me quite some time to find out where these themes can be found.\nThis is necessary to understand which files there are and which files you need to overwrite to adapt a theme.\nBasically most templates you can inherit from can be found at <a href=\"https://github.com/getnikola/nikola-themes\">nikola-themes</a>\nbut some basic templates are stored within <a href=\"https://github.com/getnikola/nikola/tree/c886ea38f7ee34f1fffb3edae7087694483a999d/nikola/data/themes\">Nikola itself</a>.\nIf you've understood this, you basically just copy/paste the files you want to adapt inside your own theme\nwhich works really nice.</p>\n<h2>Deployment with existing gh-pages</h2>\n<p>Since I had previously set up Lektor deployment via GitHub Pages, I already had a <code>gh-pages</code> branch.\nSo when I tried to deploy via <code>nikola github_deploy</code>, I got the following error:</p>\n<pre><code>To github.com:lorey/karllorey.com.git\n ! [rejected]        gh-pages -> gh-pages (fetch first)\nerror: failed to push some refs to 'git@github.com:lorey/karllorey.com.git'\nhint: Updates were rejected because the remote contains work that you do\nhint: not have locally. This is usually caused by another repository pushing\nhint: to the same ref. You may want to first integrate the remote changes\nhint: (e.g., 'git pull ...') before pushing again.\nhint: See the 'Note about fast-forwards' in 'git push --help' for details.\n# .stacktrace\n[2020-02-25T15:12:28Z] ERROR: github_deploy: Failed GitHub deployment -- command ['ghp-import', '-n', '-m', 'Nikola auto commit.\\n\\nSource commit: 5d74f162affaf80691de1d7c7b0d8728addea96a\\nNikola version: 8.0.4', '-p', '-r', 'origin', '-b', 'gh-pages', 'output'] returned 1\n</code></pre>\n<p>Obviously, I forgot to pull the gh-pages branch first, so the new commit could be added on top.\nAfter doing a <code>git pull origin gh-pages</code>, deploying worked like a charm.</p>\n<h2>Deployment with Travis CI</h2>\n<p>To deploy with Travis CI, there's a great <a href=\"https://getnikola.com/blog/automating-nikola-rebuilds-with-travis-ci.html\">post on the Nikola blog</a>.\nWhat I did not understand at first was the distinction between the <code>master</code> and a <code>src</code> branch.\nSo the <code>src</code> branch is used for user pages that are deployed into the master branch, i.e. when you have a site pointing to you username, e.g. <code>lorey.github.io</code>.\nIf you do that, you have to use another branch to deploy to avoid an infinite loop (push to master > deploy to master > ...).\nSince I use <code>gh-pages</code> as the branch containing all the generated HTML, I set up .travis.yml to deploy on pushes to master.\nIn the <code>conf.py</code> I still set:</p>\n<pre><code>GITHUB_SOURCE_BRANCH = 'src'\n</code></pre>\n<p>Seems to work fine.</p>\n<p>Another thing I encountered when setting up Travis CI:\nSomehow the travis gem had issues when logging in so <code>travis login</code> and <code>travis enable</code> did not work.\nMaybe because I use an old version or have 2FA enabled.\nIn the end I just ran <code>travis encrypt-file id_rsa --add</code> which worked fine and added a line to .travis.yml\nstoring the encrypted key.</p>\n<p>Doing a <code>git branch master FETCH_HEAD</code> inside the .travis.yml failed:</p>\n<pre><code>$ git branch master FETCH_HEAD\nfatal: A branch named 'master' already exists.\nThe command \"git branch master FETCH_HEAD\" failed and exited with 128 during .\n</code></pre>\n"}},"__N_SSG":true}