{"pageProps":{"page":{"title":"Projects and Portfolio","slug":"portfolio","date":"2020-02-26T18:10:11.000Z","tags":null,"category":null,"link":null,"description":null,"type":"text","content":"<p>These are my latest projects in chronological order from new/updated to old/offline.\nIf you're interested in my work experience, check out <a href=\"/src/pages-md/founder.md.md\">Founder</a>.</p>\n<h2>Social Media Profile Extraction</h2>\n<p>Since I'm doing a lot of social network analysis, esp. for university and First Momentum, I've always been interested to extract social profiles.\nI thus created a <a href=\"https://github.com/lorey/social-media-profiles-regexs\">collection of regular expressions to match social media profiles</a>.\nBuilding upon this collection, I've created a Python library called <a href=\"https://github.com/lorey/socials\">socials</a> that extracts social profiles from websites/html (e.g. those in my footer).</p>\n<h2>Programmer Personality</h2>\n<p><a href=\"https://programmerpersonality.com\">Programmer Personality</a> -\nTo understand the relationships between personality and the online behavior of programmers, I built this web app for my master thesis.\nFor GDPR reasons, I've taken it offline, but you could basically log in, perform a personality test, and compare your results with your peer group and other programmers.\nIn a very limited timespan, I was able to generate significant traction, got over 1000 users, and could thus get enough training data for my research.\nFor the first time, I was able to prove a relationship between personality and programmer behavior.\nI could, for example, prove that personality influences the choice of programming language, technology stack, as well as behavior on GitHub.</p>\n<h2>Programmer Map</h2>\n<p>Since my bachelor's thesis, I was very interested in influence in online social networks.\nTo apply my theoretical knowledge, I scraped GitHub and computed influencers which yielded the most influential programmers worldwide.\nTo display the results, I created <a href=\"http://programmermap.com\">ProgrammerMap</a> (now offline),\nwhere I listed the most influential programmers in around 50 cities worldwide.\nSince I'm not running the crawler anymore and GDPR compliance would take some time to implement, I had to take the site offline.</p>\n<h2>Startup Karlsruhe</h2>\n<p><a href=\"http://startup-karlsruhe.de\">Startup Karlsruhe</a> -\nAs a small side project during my time as President of <a href=\"https://pioniergarage.de\">Germany's biggest student entrepreneurship club, PionierGarage,</a>\nI built a small German site that provides an overview of the startup ecosystem in Karlsruhe.</p>\n<h2>Button1</h2>\n<p>For a startup competiton, 3 Day Startup at WHU, we developed a one click button solution like Amazon's Dash button but for B2B2C.\nDuring the two days of competition, I developed a fully-working SaaS backend.\nWith our idea called <a href=\"http://button1.de\">Button1</a> we won one of the prices.</p>\n<h2>My Secret Insights</h2>\n<p>For my Bachelor's thesis, I developed a concept very similar to that of Cambridge Analytica.\nDuring that time, it became clear that Facebook's Open Graph API yields much more information about users than intended or ethically responsible.\nTo prove this, I developed a quiz app that allows to extract Facebook user data.\nWith a single user of the quiz, we could derive how much all of their friends influence them.\nIn the end, our goal was to derive influence based on users' online behavior\nin the same way that Cambridge Analytica derived personality based on online behavior.\nMy work resulted in two publications published by my supervisor and me.</p>\n<ul>\n<li>Assessment of subjective influence and trust with an online social network game. Computers in Human Behavior, Volume 64, November 2016.</li>\n<li>Gamification framework for personalized surveys on relationships in online social networks. 2013 IEEE/ACM 6th International Conference on Utility and Cloud Computing</li>\n</ul>\n"}},"__N_SSG":true}