{"pageProps":{"page":{"title":"Talks and workshops","slug":"speaker","date":"2020-02-25T10:03:11.000Z","tags":null,"category":null,"link":null,"description":null,"type":"text","content":"<p>I love what I do and talk about it as often as I can. Here is a selection of talks and workshops I've given recently:</p>\n<h2>2019</h2>\n<ul>\n<li>Guest lecture at EBS in Oestrich-Winkel on how to finance your startup.</li>\n<li>Workshop on how not to fuck up your startup at Start Nuremberg-Erlangen.</li>\n<li>Mentor at <a href=\"http://3dsgermany.de/\">3 Day Startup Germany</a>, a startup weekend. WHU, Vallendar, Germany.</li>\n<li>Jury member at <a href=\"https://www.start-nuernberg.de/rtss\">Road to Start Summit</a> in Nuremberg, Germany.</li>\n</ul>\n<h2>2018</h2>\n<ul>\n<li>Interview on German radio at <a href=\"https://www.swr.de/swr2/programm/sendungen/tandem/swr2-tandem-was-menschen-bewegt-ein-junges-finanz-startup-fuer-andere-junge-startups/-/id=8986864/did=20962488/nid=8986864/14bwrs7/index.html\">SWR2 Tandem Rakete</a></li>\n<li>\"Introduction to Machine Learning and Artificial Intelligence\" at <a href=\"http://pioniergeist.xyz/\">Pioniergeist</a> in a workshop for Daimler HR executives. Stuttgart, Germany.</li>\n<li>Presenting First Momentum Ventures at <a href=\"https://startsummit.ch\">Start Summit</a>, a student entrepreneurship conference. St. Gallen, Switzerland.</li>\n<li>\"How to build a product users love\" at <a href=\"http://3dsgermany.de/\">3 Day Startup Germany</a>, a startup weekend. WHU, Vallendar, Germany.</li>\n<li>Presenting First Momentum Ventures at <a href=\"https://www.vc-bw.de/veranstaltungen/venture-capital-pitch/7-venture-capital-pitch/\">VC-BW</a>, a German VC forum. Stuttgart, Germany.</li>\n</ul>\n<h2>2017</h2>\n<ul>\n<li>Presenting First Momentum Ventures at the <a href=\"http://www.ev-akademie-boll.de/tagungsarchiv/621117.html\">annual ifex conference</a>. Bad Boll, Germany.</li>\n<li>\"Automating stuff with Python\" at <a href=\"http://foundersclub-freiburg.de/\">Foundersclub Freiburg</a>. Freiburg, Germany.</li>\n<li>\"Meet the founder: Karl Lorey, First Momentum\" at <a href=\"https://pioniergarage.de\">PionierGarage</a>. Karlsruhe, Germany.</li>\n<li>\"Getting Momentum with First Momentum\" at <a href=\"http://foundersclub-freiburg.de/\">Foundersclub Freiburg</a>. Freiburg, Germany.</li>\n<li>\"How to build your first website in 8 hours\" at <a href=\"http://businessmeets.tech/\">Business meets Tech</a>, a student initiative at WHU. WHU, Vallendar, Germany.</li>\n</ul>\n<h2>2016</h2>\n<ul>\n<li>TEAL: Transparent Encryption for the Database Abstraction Layer at <a href=\"http://caise2016.si/\">CAiSE 2016</a>, Ljubljana, Slovenia</li>\n<li>From idea to founder at <a href=\"https://www.kit.edu/kit/20083.php\">KIT Venture Fest</a>, a conference on innovation and startups at KIT. Karlsruhe, Germany.</li>\n<li>several tech workshops at <a href=\"https://pioniergarage.de\">PionierGarage</a>, the student entrepreneurship club at KIT. (Crawling, SQL, Python, HTML). Karlsruhe, Germany.</li>\n</ul>\n<h2>Older (selection)</h2>\n<ul>\n<li>Presenting Road Genius at Volkswagen IT Symposium in front of C-level executives including then-CEO Winterkorn. Wolfsburg, Germany.</li>\n</ul>\n"}},"__N_SSG":true}