{"pageProps":{"page":{"title":"My technical background","slug":"techie","date":"2020-02-25T10:03:11.000Z","tags":null,"category":null,"link":null,"description":null,"type":"text","content":"<p>I've studied computer science,\ndid a lot of research during university in machine learning and databases but also touching psychology,\nand love to build things with the help of technology.\nThis page is about my academic and technical background,\nprojects <a href=\"/src/pages-md/founder.md.md\">can be found elsewhere</a>.</p>\n<h2>Academic background and computer science</h2>\n<p>During my time as a student at university, I published three papers:\nTwo about human behavior in online social networks\nand one on integrating a database encryption into the Database Abstraction Layer (DBAL).</p>\n<h3>Research on human behavior in social networks</h3>\n<p>In 2013, I wrote my bachelor thesis about a concept very similar to Cambridge Analytica.\nI basically built a Facebook app which showed how to extract information\nby increasingly requesting more and more permissions to access Facebook API data.\nAs a result of this research, I published my first two papers.\nMy masters thesis was about the impact of personality on the behavior of programmers.\nIn particular, I examined the personality of programmers and how it affects their behavior on GitHub.\nTo do this, I performed a study with over 1000 developers to establish a ground truth.\nWith this data, it was possible to show significant effects of personality on programmers' behavior.\nWe could for example show that programmers with specific personality traits\nprefer specific languages, libraries, stacks, and tools.</p>\n<h3>Publications</h3>\n<p>I have published the following papers in scientific journals so far:</p>\n<ul>\n<li>TEAL: Transparent Encryption for the Database Abstraction Layer. Proceedings of the CAiSE'16 Forum at the 28th International Conference on Advanced Information Systems Engineering, Ljubljana, Slovenia, 13-17.6.2016</li>\n<li>Assessment of subjective influence and trust with an online social network game. Computers in Human Behavior, Volume 64, November 2016.</li>\n<li>Gamification framework for personalized surveys on relationships in online social networks. 2013 IEEE/ACM 6th International Conference on Utility and Cloud Computing</li>\n</ul>\n<h2>Stack</h2>\n<p>I believe that people should focus on things that they can do better than machines.\nThat's why I love to automate complex and time-consuming problems\nand thus many of my projects revolve around the automation of a specific task\nor are about the deduction of previously unknown information.\nTo do this, I develop systems to gather the required data,\nbuild machine learning algorithms on top,\nand close the feedback loop to train the system with human training data.</p>\n<h3>Topics</h3>\n<p>My technical focus is build upon the following pillars:</p>\n<ul>\n<li>building prototypes and Minimum Viable Products as quick as possible</li>\n<li>crawling and scraping to gather required data</li>\n<li>data analysis and machine learning to perform automated decisions (natural language processing, classification)</li>\n<li>web development to build an interface for training data and data exploration</li>\n</ul>\n<p>You can find projects I can talk about publicly <a href=\"/src/pages-md/founder.md.md\">in my portfolio</a>.</p>\n<h3>Technologies</h3>\n<p>In the last years, Python has become my main stack.\nThe main reason might be that it allows me to do everything I love in the same stack:\ncrawling, machine learning, and web development.\nI also like the syntax and the simplicity.</p>\n<p>To give you an overview, these are the technologies I really enjoy working with:</p>\n<ul>\n<li>Crawling: scrapy, selenium, good old requests with Python</li>\n<li>Machine Learning: pandas, scikit-learn, spaCy with Python</li>\n<li>Web: Django, Flask, jinja with Python, and HTML/CSS</li>\n<li>Storage: Postgres, sqlite, elasticsearch, SQLAlchemy with SQL, Python</li>\n<li>Deployment: Docker, AWS, terraform, ansible, pytest, Makefile</li>\n<li>OS/IDE: Debian, i3wm, PyCharm, bash, git, ...</li>\n</ul>\n<p>Other programming languages and tools I have used:</p>\n<ul>\n<li>I've started to learn react, react-native and also JavaScript.\nThis will not become a focus, but a little Full Stack experience doesn't hurt.</li>\n<li>for older projects I used PHP, Laravel, and MySQL.\nI especially liked the simplicity of Laravel\nbut found myself preferring Django because of the ecosystem.</li>\n<li>in university, I used a lot of Java. I don't like the syntax and toolchain very much though.</li>\n</ul>\n<h2>My desktop environment</h2>\n<p>Currently, I'm running Debian with xfce and the i3 window manager.\nThis allows me to use my keyboard and avoid the mouse most of the time.\nIf you're interested, you can find <a href=\"https://github.com/lorey/dotfiles\">my dotfiles on GitHub</a>.</p>\n"}},"__N_SSG":true}